app/views/search/index.html.erb

SELECT `findings`.* FROM `findings` WHERE (description LIKE '%vishant%' OR category LIKE '%vishant%' OR risk_rating LIKE '%vishant%'
---
        <div class="panel panel-default">
        <% audit.findings.each do |finding| %>