app/views/findings/_form.html.erb

SELECT `finding_types`.* FROM `finding_types`
---
      <div class="input-sm">
      <%= f.input :category, collection: FindingType.all, label_method: :category_name, value_method: :category_name %>

SELECT `risks`.* FROM `risks`
---
      <div class="input-sm">
      <%= f.input :risk_rating, collection: Risk.all, label_method: :risk_name, value_method: :risk_name %>

SELECT `finding_statuses`.* FROM `finding_statuses`
---
      <div class="input-sm">
      <%= f.input :status_id, collection: FindingStatus.all, label_method: :status_name, value_method: :status_name %>