app/views/audits/index.html.erb

SELECT "audits".* FROM "audits"
---
                 <div class="form-group">
                  <%= collection_select(:organization, :organiation_name, Audit.all, :organiation_name, :organiation_name, :class=>"selectpicker") %>

SELECT `findings`.* FROM `findings` WHERE `findings`.`audit_id` = 11
---
      <div class="panel panel-default" >
      <% audit.findings.each do |finding| %>