app/views/audits/show.html.erb

SELECT `findings`.* FROM `findings` WHERE `findings`.`audit_id` = 11
---
          <%= will_paginate @findings %>
              <% if @audit.findings!= [] %>

SELECT `documents`.* FROM `documents` WHERE `documents`.`finding_id` = 19
---
                    <br/><br/>
                    <p><% finding.documents.each do |document| %>