app/views/dashboards/index.html.erb

SELECT COUNT(*) FROM `audits` WHERE `audits`.`user_id` = 2
SELECT `audits`.* FROM `audits`
---
                  <%# @current_user.audits.count %>
            <%= link_to @current_user.audits.count, audits_path %>

SELECT `findings`.* FROM `findings`
---
         <% if @capa_pending_audits != [] %>
           <% @capa_pending_audits.first.findings.each do |finding| %>

SELECT COUNT(*) FROM `findings`
---
      function drawPieVisualization() {
           var data = google.visualization.arrayToDataTable([
          ['Findings', 'Months'],
          ['CAPA Pending',    <%= @findings_capa_pending.count%>],
         ['Under Review',     <%= @findings_under_review.count%> ],
          ['Closed',  <%= @findings_closed.count%>],
         ]);