app/controllers/audits_controller.rb

SELECT COUNT(*) FROM `audits` WHERE `audits`.`user_id` = 2
SELECT `audits`.* FROM `audits` WHERE `audits`.`user_id` = 2 ORDER BY id DESC LIMIT 3 OFFSET 0
---
  def index
    @audits_not_started = current_user.audits.where('start_date > ?',Time.now)
    @audits= current_user.audits.paginate(:page => params[:page], :per_page => 3).order('id DESC')

SELECT `audits`.* FROM `audits` WHERE `audits`.`user_id` = 2 AND `audits`.`id` = 20 LIMIT 1
SELECT COUNT(*) FROM `findings` WHERE `findings`.`audit_id` = 11
SELECT `findings`.* FROM `findings` WHERE `findings`.`audit_id` = 11 ORDER BY id DESC LIMIT 7 OFFSET 0
---
  def show
    @audit = current_user.audits.find(params[:id])
    @findings= @audit.findings.paginate(:page => params[:page], :per_page => 7).order('id DESC')

SELECT `audits`.* FROM `audits` WHERE `audits`.`user_id` = 2 AND `audits`.`id` = 21 LIMIT 1
---
  def edit
    @audit = current_user.audits.find(params[:id])

SELECT `audits`.* FROM `audits` WHERE (auditor_email = 'Erum@nokia.com' or auditee_email = 'ramesh@yahoo.com')
INSERT INTO `audits` (`audit_type`, `auditee_email`, `auditee_name`, `auditor_email`, `auditor_name`, `created_at`, `department_name`, `end_date`, `start_date`, `updated_at`, `user_id`) VALUES ('9001', 'ramesh@yahoo.com', 'Ramesh', 'Erum@nokia.com', 'Erum', '2014-01-17 05:57:59', 'Test 1', '2014-01-17 23:59:00', '2014-01-17 11:30:00', '2014-01-17 05:57:59', 1)
---
  def create
    @audit = current_user.audits.new(params[:audit])
    audit = params[:audit]
    start_date = DateTime.new(params["audit"]["start_date(1i)"].to_i, params["audit"]["start_date(2i)"].to_i,params["audit"]["start_date(3i)"].to_i,
                                                                    params["audit"]["start_date(4i)"].to_i,params["audit"]["start_date(5i)"].to_i)

    end_date = DateTime.new(params["audit"]["end_date(1i)"].to_i, params["audit"]["end_date(2i)"].to_i,params["audit"]["end_date(3i)"].to_i,
                                                                    params["audit"]["end_date(4i)"].to_i,params["audit"]["end_date(5i)"].to_i)
     @all_audits = Audit.where("auditor_email = ? or auditee_email = ?",params[:audit][:auditor_email], params[:audit][:auditee_email])

      @all_audits.each do |audit|
             if (audit.start_date.to_i..audit.end_date.to_i).include?(start_date.to_i||end_date.to_i)
               @audit.errors[:base] << "Auditor or auditee is already assigned, please select another date "

SELECT `audits`.* FROM `audits` WHERE `audits`.`user_id` = 2 AND `audits`.`id` = 21 LIMIT 1
UPDATE `audits` SET `start_date` = '2014-01-16 06:59:00', `updated_at` = '2014-01-16 11:04:53' WHERE `audits`.`id` = 11
---
  def update
    @audit = current_user.audits.find(params[:id])

    respond_to do |format|
      if @audit.update_attributes(params[:audit])

SELECT `audits`.* FROM `audits` WHERE `audits`.`user_id` = 1 AND `audits`.`id` = 12 LIMIT 1
DELETE FROM "audits" WHERE "audits"."id" = ?  [["id", 3]]
---
  def destroy

    @audit = current_user.audits.find(params[:id])
    @audit.destroy

SELECT `audits`.* FROM `audits` WHERE `audits`.`user_id` = 2 AND `audits`.`id` = 22 LIMIT 1
---
  def export_findings
    audit = current_user.audits.find(params[:audit_id].to_i)

SELECT `findings`.* FROM `findings` WHERE `findings`.`audit_id` = 11
---
       #end
      end

    audit.findings.each do |finding|

SELECT `findings`.* FROM `findings` WHERE `findings`.`audit_id` = 12
---
  def find_capa
    puts "action called*************************"
    puts params.inspect
    puts "********************************"
    @capa = Finding.find(params[:finding_id]).corrective_action