app/controllers/dashboards_controller.rb

  def index
    @audits = current_user.audits.find(:all)

    @finding_count =0
    @open_audits_count = 0
    @open_audits = []
    @upcoming_audits = []

    @audits.each do |audit|
      audit.findings.each do|finding|
---
SELECT `audits`.* FROM `audits`
SELECT `findings`.* FROM `findings`