app/controllers/findings_controller.rb

SELECT COUNT(*) FROM `findings`
SELECT `findings`.* FROM `findings` ORDER BY id DESC LIMIT 1 OFFSET 0
---
  def index
     @findings= Finding.paginate(:page => params[:page], :per_page => 1).order('id DESC')

SELECT `findings`.* FROM `findings` WHERE `findings`.`id` = 22 LIMIT 1
---
  def show
    @finding = Finding.find(params[:id])

SELECT `findings`.* FROM `findings` WHERE `findings`.`id` = 19 LIMIT 1
---
  def edit
    @finding = Finding.find(params[:id])

INSERT INTO `findings` (`audit_id`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `category`, `corrective_action`, `created_at`, `date_created`, `description`, `document_id`, `iso_clause`, `preventive_action`, `risk_rating`, `status_id`, `updated_at`) VALUES (11, NULL, NULL, NULL, NULL, 'Non-Compliance', '', '2014-01-16 10:37:34', NULL, 'finding export', NULL, '4', '', 'Medium', 'CAPA Submitted', '2014-01-16 10:37:34')
---
  def create
  #  @content = current_user.widget_contents.build(params[:widget_content])
    @finding = Finding.new(params[:finding])
    #@finding.documents.build

    puts "*********params inspect**************#{params.inspect}"
    respond_to do |format|
    #  puts "*********finding**************#{@finding.inspect}"
    #  puts "*********attachments**************#{params[:attachment].inspect}"
    if @finding.save

SELECT `findings`.* FROM `findings` WHERE `findings`.`id` = 22 LIMIT 1
INSERT INTO `activities` (`action`, `created_at`, `targetable_id`, `targetable_type`, `updated_at`, `user_id`) VALUES ('updated', '2014-01-21 13:43:56', 22, 'Finding', '2014-01-21 13:43:56', 1)
---
  def update
    @finding = Finding.find(params[:id])
    puts "***********update action************"
    puts params.inspect
    puts "***************************************"
    respond_to do |format|
      if @finding.update_attributes(params[:finding],:audit_id => params[:audit_id])
          current_user.create_activity @finding, 'updated'

SELECT `findings`.* FROM `findings` WHERE `findings`.`id` = 21 LIMIT 1
DELETE FROM `findings` WHERE `findings`.`id` = 21
INSERT INTO `activities` (`action`, `created_at`, `targetable_id`, `targetable_type`, `updated_at`, `user_id`) VALUES ('destroyed', '2014-01-21 09:08:19', 21, 'Finding', '2014-01-21 09:08:19', 1)
---
  def destroy
    @finding = Finding.find(params[:id])
    @finding.destroy

    respond_to do |format|
        current_user.create_activity @finding, 'destroyed'