app/controllers/search_controller.rb

  def index
    @audits = Audit.paginate(:page => params[:page], :per_page => 10).find(:all, :conditions => ['department_name LIKE :search OR auditee_name LIKE :search OR auditee_email LIKE :search
                                  OR auditor_name LIKE :search OR auditor_email LIKE :search OR audit_type LIKE :search ', {:search => "%#{params[:search]}%"}])
---
SELECT `audits`.* FROM `audits` WHERE `audits`.`id` = 11 LIMIT 1